**SQL** can be divided into two parts:
   - DDL (Data Definition Language)
   - DML (The Data Manipulation Language)

### DML

- *SELECT* - extracts data from a database
- *UPDATE* - updates data in a database
- *DELETE* - deletes data from a database
- *INSERT* *INTO* - inserts new data into a database

### DDL

- *CREATE DATABASE* - creates a new database
- *ALTER DATABASE* - modifies a database
- *CREATE TABLE* - creates a new table
- *ALTER TABLE* - modifies a table
- *DROP TABLE* - deletes a table
- *CREATE INDEX* - creates an index (search key)
- *DROP INDEX* - deletes an index

In [ ]:
# !pip install ipython-sql

In [ ]:
%load_ext sql

In [2]:
%sql sqlite:///base.db

In [6]:
# show all table names
%%sql
SELECT 
    name
FROM 
    sqlite_schema

 * sqlite:///base.db
Done.

[('Categories',),
 ('Customers',),
 ('Employees',),
 ('OrderDetails',),
 ('Orders',),
 ('Products',),
 ('Shippers',),
 ('Suppliers',)]

### SELECT Statement

**SQL SELECT Syntax**
- SELECT column_name(s) FROM table_name

In [10]:
%%sql 
SELECT * FROM Customers LIMIT 5 
# LIMIT show first n column
# * shows every column

 * sqlite:///base.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico'),
 (4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')]

In [12]:
%%sql 
SELECT CustomerName,Country FROM Customers LIMIT 5;

 * sqlite:///base.db
Done.

[('Alfreds Futterkiste', 'Germany'),
 ('Ana Trujillo Emparedados y helados', 'Mexico'),
 ('Antonio Moreno Taquería', 'Mexico'),
 ('Around the Horn', 'UK'),
 ('Berglunds snabbköp', 'Sweden')]

### SQL SELECT DISTINCT Statement

- SELECT DISTINCT column_name(s) FROM table_name
- DISTINCt show unique values from column

In [13]:
%%sql
SELECT DISTINCT Country FROM Customers LIMIT 5;

 * sqlite:///base.db
Done.

[('Germany',), ('Mexico',), ('UK',), ('Sweden',), ('France',)]

### WHERE Clause

- The WHERE clause is used to filter records.
- The WHERE clause is used to extract only those records that fulfill a specified criterion.
- SQL WHERE Syntax

In [19]:
"""SELECT column_name(s)
   FROM table_name
   WHERE column_name operator value """

'SELECT column_name(s)\n   FROM table_name\n   WHERE column_name operator value '

In [17]:
%%sql
SELECT CustomerName FROM Customers where Country = 'UK'

 * sqlite:///base.db
Done.

[('Around the Horn',),
 ("B's Beverages",),
 ('Consolidated Holdings',),
 ('Eastern Connection',),
 ('Island Trading',),
 ('North/South',),
 ('Seven Seas Imports',)]

### Operators Allowed in the WHERE Clause

In [ ]:
"""
= -> equal
<> -> not equal
> -> greater than
< -> less than
>= -> Greater than or equal
<= -> Less than or equal
BETWEEN -> Between an inclusive range
LIKE -> Search for a pattern
IN -> If you know the exact value you want to return for at least one of the columns

"""

### AND & OR Operators